Repository: adslbarxatov/SudokuSolver
Catalog: src/SudokuSolver_*.resx
Languages: ru_ru

# DoingSearch
source: Searching for solution...
ru_ru: Поиск решения...

# MActivities_MCheck
source: Chec&k solution
ru_ru: Про&верить решение

# MActivities_MClear
source: &Cancel the solution
ru_ru: &Отменить решение

# MActivities_MGenerate
source: &New game
ru_ru: &Новая игра

# MInfo_MHelp
source: &Help
ru_ru: &Помощь

# MSettings_MLanguage
source: La&nguage
ru_ru: &Язык

# MActivities_MLoad
source: &Load from file...
ru_ru: &Загрузить из файла...

# MActivities_MReset
source: &Reset the table
ru_ru: С&бросить таблицу

# MActivities_MSave
source: &Save to file...
ru_ru: &Сохранить в файл...

# MActivities_MSolve
source: &Find solution
ru_ru: &Решить

# MainMenu_MActivities
source: &Actions
ru_ru: &Действия

# MessageNotEnough
source: There is not enough numbers in the specified file to build the sudoku table
ru_ru: В указанном файле недостаточно чисел для построения таблицы судоку

# MGenerate_MDifficulty0
source: &Easy
ru_ru: &Простая

# MGenerate_MDifficulty1
source: &Medium
ru_ru: С&редняя

# MGenerate_MDifficulty2
source: &Hard
ru_ru: С&ложная

# OFFilter
source: Text documents (*.txt, *.csv)|*.txt;*.csv
ru_ru: Текстовые документы (*.txt, *.csv)|*.txt;*.csv

# OFName
source: Select a text file with sudoku table
ru_ru: Выберите текстовый файл с таблицей судоку

# ResetWarning
source: Reset all values in all cells?
ru_ru: Сбросить все значения в ячейках?

# SFName
source: Specify a name for a new file
ru_ru: Укажите имя для нового файла

# SolutionIsCorrect
source: Solution is correct, keep going!
ru_ru: Решение корректно, так держать!

# SolutionIsIncorrect
source: This solution contains mistakes
ru_ru: В решении содержатся ошибки

# MainMenu_MSettings
source: &Settings
ru_ru: &Настройки

# MainMenu_MInfo
source: &Info
ru_ru: &Инфо

# ColorSchemeLabel
source: Color scheme:
ru_ru: Цветовая схема:

# CellsAppearanceLabel
source: Cells appearance:
ru_ru: Представление ячеек:

# MInfo_MStats
source: &Game statistics
ru_ru: С&татистика игры

# SolvedText
source: Solve
ru_ru: Задача решена!

# StatsText
source: Game mode results: Points (total): {0:S} Wins (easy-medium-hard): {1:S} Best solution time: {2:S} Longest unchecked chain: {3:S}
ru_ru: Результаты игрового режима: Очков (всего): {0:S} Победы (простые-средние-сложные): {1:S} Лучшее время решения: {2:S} Длиннейшая цепочка без проверок: {3:S}

# NewGameButton
source: New game
ru_ru: Новая игра

# CheckButton
source: Check
ru_ru: Проверить

# ClearButton
source: Return
ru_ru: Вернуть

# AppModeMessage
source: Game mode is active: {1:S} Current difficulty: {0:S} The app is tracking wins: {1:S} Changing generated cells is not possible: {1:S}
ru_ru: Игровой режим активен: {1:S} Текущая сложность: {0:S} Приложение ведёт учёт выигрышей: {1:S} Изменение сгенерированных ячеек недоступно: {1:S}

# AppModeFlag
source: Adjust the interface for game mode
ru_ru: Адаптировать интерфейс под игровой режим

# DifficultyMessage
source: Select the difficulty level
ru_ru: Выберите уровень сложности

# HighlightLabel
source: Highlighting of affected cells:
ru_ru: Выделение связанных ячеек:

# Achi0
source: ③ “Guess in three tries” achievement Appears every time when: - two or less checks done (including the last one) on easy game - three or less checks done on medium game - four or less checks done on hard game
ru_ru: ③ Достижение «угадать с трёх раз» Выдаётся каждый раз, когда: - не более двух проверок (включая последнюю) сделано в лёгкой игре - не более трёх проверок сделано в средней игре - не более четырёх проверок сделано в сложной игре

# Achi1
source: 👍 “No mistakes” achievement Appears every time when all checks are successful
ru_ru: 👍 Достижение «без ошибок» Выдаётся каждый раз, когда все проверки оказываются успешными

# StatsTextAchi
source: Achievements: ③ {0:S} - 👍 {1:S}
ru_ru: Достижения: ③ {0:S} - 👍 {1:S}

# MHighlight0
source: No
ru_ru: Нет

# MHighlight1
source: Lines only
ru_ru: Только линии

# MHighlight2
source: Lines and squares
ru_ru: Линии и квадраты

# MSettings_MParameters
source: &Parameters
ru_ru: &Параметры

# MInfo_MState
source: App s&tatus
ru_ru: С&татус программы
